实现步骤与原理总结
首先，总结一下预测IK的实现原理/步骤，理清整个计算过程会让思路清晰得多；整个实现思路主要是学习 @Shadow 佬的 预测脚步IK实现-PredictFootIK

一--预测下一次的落脚点
1---记录上一次脚落下的位置；
2---根据上一次脚落下的位置，当前距离下一次落脚的时间，以及当前的速度来预测下一次落脚的水平位置；
3---在预测的水平位置处进行检测，找到下一次落脚的竖直位置，此时就得到了下一次落脚的位置信息；


图中绿色方体的是上一步落脚点，红色为预测的下一步落脚点
二--计算脚的运动路线(实际是增幅路线)FootPath
1---分别以前后两次落脚点为起点终点，进行两次检测；如果产生碰撞，则从碰撞点的上方向下检测，得到新的点；
2---以新的点作为起点终点，重复上述行为，再次得到新的点；
3---不断迭代，直到达到预设的迭代次数，或者没有产生新的碰撞；将所有点按顺序连接起来，得到的就是整个FootPath；


图中的蓝色方体为FootPath的路径点，红线则为脚的运动路径
三--采样FootPath
采样上一步的FootPath，得到当前帧脚的高度；


图中的绿色方框是实际采样的FootPath位置，红色方框是插值处理后的FootPath位置；
四--对计算出来的结果进行一些额外的处理
这一步实际上并不是必须的，不过我个人在实现的过程中，发现有一些问题很难直接解决，所以进行了一些额外的计算，比如发力脚下沉，穿墙修复；

五--应用计算结果到Pose
将前面的计算结果应用到动画，在这里我采用的是ALS的实现方式，也就是提前制作VB虚拟骨骼当做变量使用，而角色原本的ik骨骼当做参考信息，只用于计算而不做实际修改；

隐含的计算--盆骨位置
前面说的步骤已经能实现出脚部预测了，但是这样的实现结果表现并不好；一个很关键的原因在于脚部独立于身体计算，这会导致脚到盆骨的距离是不可控的，产生一些奇怪的效果，比如腿部过度压缩或者拉伸等；因此，还需要对盆骨进行一些额外的计算处理；

一---关于预测落脚点
预测落脚点实现起来比较简单，当脚落下时，记录下脚的世界坐标并转换为Actor本地坐标；然后每帧还原Actor坐标为世界坐标，并加上 剩余时间*速度，得到预测的水平坐标；

这一块的计算里面，速度和剩余时间基本上不会出错，而误差其实出现在记录脚的世界坐标的时间；要保证预测位置正确，很重要的一点是要保证预测位置的动作和记录位置的动作是同样的，对循环动画来说，就是预测的时间点和上一步的记录踩下的时间点是在同一处；

这样说可能有一些难懂，这里拿我的曲线来解释，我定义了两种曲线；一个是FootState，1表示脚踩下，0表示脚抬起；另一个是FootDown_Time（原谅我的塑料英语），表示的是从当前帧到下一次脚落地还需要多长时间；

那么前面说 要保证预测位置的动作和记录位置的动作是同样的 该如何理解呢？按这个动画来说，我记录的剩余时间曲线是的意义是 从当前动画帧到下一次播放图片中的姿势（也就是图片中左脚刚刚踩实的姿势）还需要多久；

所以说，这里曲线的时间都明确指向的是图片中这个姿势，也就是说，距离出现这个姿势还需要多久；因此，一个显而易见的结论就是：我们预测的脚的位置，正是下一次出现这个姿势时，脚的所在位置。从Actor坐标来看，到达预测的位置时，脚的Actor坐标 同样是上一次记录的落地时 脚的Actor坐标；

简单用例子说明一下就是：如果用于计算的时间表示是从 现在 到 左脚刚落地 的 剩余时间，那么就同样应该用上一次左脚刚落地时候的Actor坐标来作为起始点进行预测；


小细节一：动画序列中的一帧不是实际游戏的一帧，在实际运行中可能是3帧4帧5帧，所以需要进行额外的处理使每次循环只记录第一帧的坐标；
小细节二：对于不同的动画，记录时机最好一致，比如都用刚踩下时作为记录点，这样可以减少一点混合时的问题；
小细节三：对角线修正，在进行动画计算时可能对对角线进行了额外的处理，比如ALS中的对角线修正计算，Lyra的Stride Wrapping也可以算在其中；也就是说，这里在预测的时候不要忘了步距处理；
小细节四：计算剩余时间曲线的时候，最好不要将目标设置为脚的水平位置越过root，原因马上说；
个人Trick：计算时难免有误差，预测位置和实际位置即使只有一点点错位，也可能导致后面检测的高度差别较大，这很容易产生动画跳变；我个人在这里给了一个阈值，也就是说如果实际的踩下位置和先前的预测位置出入比较小，那么就直接将预测位置作为新的踩下位置；
二---计算盆骨位置
Shadow佬在这里直接通过设置Mesh来实现盆骨的平滑位移，我也是模仿这个方法来实现的，不过我个人的实现后面再说；

计算盆骨的位置，重点在于选择好当前步伐的起始点；当前步伐并不是指某一只脚的运动，而是两条腿共同组成的，如下图所示，角色当前迈出的步子是右脚在后，左脚在前，右脚踩在落地点上，而左脚踩向预测点；

因此，当前步伐的起始点是右脚的落地点，终点是左脚的预测点；


当前步伐由图中的红线所示
以此类推，我们可以发现有四种可能的情况；按照 起点---终点 来书写，就是下面的四张图：
1：左脚落脚点---右脚落脚点；


左脚落脚点---右脚落脚点
2：右脚落脚点---左脚落脚点；


右脚落脚点---左脚落脚点
3：右脚落脚点---左脚预测点；


右脚落脚点---左脚预测点
4：左脚落脚点---右脚预测点；


左脚落脚点---右脚预测点
一共四种可能的前后组合，那么这些组合是在何时切换的呢？经过观察可以发现，有两种情况会导致这些组合发生改变：

一是有某个脚踩下了，此时该脚所属的预测点成为新的落脚点，并且产生了新的预测点；

二是两脚的前后位置发生了改变，比如从左脚前右脚后变成了右脚前左脚后；

所以我们只需要在这两种条件触发的时候进行一次判断即可；这就是为什么我在上一步说最好不要将脚过root当做落脚时机来进行进行落地检测处理，脚过root的时机 和 两脚前后位置改变的时机 比较接近甚至重合，可能产生错误；

知道了步伐的起始点，Mesh的插值就比较简单了，我在这里直接使用Mesh的到两个端点的水平距离进行插值；针对上下坡了，插值也有不同的处理，这一段直接看Shadow佬原文即可；

个人Trick：这个实现方法非常方便，但是有一个小问题，就是Mesh的位置和脚的实际位置是相对独立的，Mesh的高度通过对步伐起点和终点插值得到，这很容易导致下面的问题：地面变化多时，插值较快则角色上下波动较大，插值较慢则可能Mesh还来不及抬高，脚已经在往上走了，这就导致了盆骨的过度下压或抬升；个人的解决方式在后面会进行介绍，主要是通过脚的位置反向推导Mesh的位置；

可能产生的问题
三---计算脚的运动路线（实际是增幅路线）FootPath

实现出来的路径；
这一步实现起来很简单，以两端为端点进行检测，检测到新的碰撞后再进行迭代，最终得到路径点并整合为数组；由于笨人是美术生，对算法问题就不多BB了，可以直接看Shadow佬原文；

小细节：计算出来的路径不是最终脚的运动路径，而是增量路径；具体的后面会说；
个人Trick：这一步检测的碰撞点+脚高就是路径点了，但同样可以针对这些点进行一些额外的艺术处理；打个比方：我给碰撞点额外进行了一点计算，使其距离预测点或者落地点越远，路径点就越高，这样的动画结果会更加好看一点；同样的，由于我们是以两个端点同时向对方进行检测，所以我们理所当然的会进行两个检测节点，一个从预测点出发，一个从落脚点出发；针对两个检测节点的结果进行不同的处理，可以实现更多效果；

个人的一些额外处理；
四---采样FootPath
这一步和上面采样盆骨路线很像，我这里是用ik骨的位置来进行采样，然后就是脚下落时插值更快一点，走路和跑步的插值速度做区分等等；这一段可讲的不多，比较简单；


采样脚的运动路线FootPath
这里需要额外说明的是，这个FootPath并不是我们最终的脚的位置，我个人将其作为一个增量来看，怎么理解呢？看下图：


FootPath与实际的运动路线对比
图中的红线是FootPath，黄线是落地点和预测点的连线，白线才是真正的脚腕的运动路线；

这样的处理也比较符合我们的直觉，毕竟人类的运动不可能是平平整整的笔直的线；同时，动画师K的动画本身就充满了细节，比如脚抬起时的速度较快，落下较慢，比如脚的最高点不是在两次落地的正中间等等；那么如何保留住这样的信息呢？在这里我的计算方式是，计算FootPath.z-BasePath.z，也就是图中红线相对于黄线的增量，将这个增量叠加到脚的位置上；实现对脚的抬高处理，这里同样可以理解为在FootPath上叠加动画本身的脚抬高程度；

BasePath.z直接使用Mesh.z+8(脚高)即可；

但是这个计算方式也有问题，对于走路尚可，因为走路的动画本身的抬高程度不算大，按照上面提到的后者来理解，相当于叠加到FootPath上的抬高程度并不算大；但是对于跑步和冲刺，或者其他抬腿脚高的动画呢？

关于这个点，我个人的处理方式比较简单粗暴：我会先通过当前步伐（前面计算盆骨时候的信息）来判断当前角色是否正在上下坡，对于非上下坡的情况，直接按照原本的计算方式即可，因为FootPath并不大，同时也可以尽可能保持动画原本的姿态；
对于上下坡，我在原本的计算基础上加上了一个 动画本身的抬起高度*系数 ，也就是说对动画本身的抬起高度做一个缩减，使其不要在FootPath的基础上再抬高过多；

这样处理下来，实际的运动动画就还基本能看了，但是上下楼梯仍然是很严重的问题，特别是对于跑步的上下楼梯，我还没有想到什么比较好的调优方法；（叹气）

个人Trick：对于FootPath通常要进行平滑处理，但是这会导致一个问题，那就是落地脚可能来不及落地，就被新的FootPath给插值走了；对于这一点，我尝试了给下降的FootPath提高插值速度（前文有提到），但是效果并不明显；反复尝试后发现针对是否踩下进行两种计算比较好；当脚踩下时，将脚的位置插值到预测点/落地点，相当于将该脚锁定到一个定点，而短暂的不去采样新的FootPath；
五---应用ik
这一步就不用多说了，用ControlRig也好，像ALS一样用虚拟骨骼也好，将计算结果应用到动画上即可；

小细节：直接修改ik导致结果错误
如果直接将计算的结果设置到ik上，会导致下一帧蓝图读取的ik位置是上一帧计算的结果，而不是按照时间步进的动画位置，这样产生的错误计算又会继续影响下一帧的计算；解决方法就是始终不要设置ik骨，而把ik作为一个参考；

这要怎么理解呢？我们的计算能够实现，一个原因是计算过程不出问题，还有一个就是计算本身的输入不出问题；对于动画来说，就是我们得到的动画信息本身是正确的；

假如，我们始终用ik的水平位置向下进行射线检测，按理来说，ik本身会随着动画运动，我们的检测结果也是正确的；但如果我们给ik赋值呢？如果我们将ik位置设置为碰撞点，那么，假设第0帧ik位置是(0,0,90)，检测到的碰撞点是(0,0,0)；那么第1帧ik的位置就会被设置成(0,0,0)，碰撞点也会变成(0,0,0)；就这样ik位置始终在原点；

总的来说，就是我们希望获得实际的动画信息，也就是用【动画原生Pose】来进行计算；在预测ik的计算中，我们始终将ik骨的位置认定为会随着时间步进的【动画原生Pose】，但如果给ik进行了额外的设置，就会使ik脱离【动画原生Pose】，而被计算结果覆盖，成为别的信息，这也使其不符合我们新一轮计算的需要；

解决方法很简单，就是不直接修改ik，而使用其他的骨骼/虚拟骨骼或者控制器作为变量存储变换目标；


直接修改ik的错误效果
（老实说这一段说的有点又臭又长了，不过不写出来感觉有点对不起自己理解这个错误时候的惊喜）

到这里为止，脚部预测就已经结束了，后面的内容是我个人的一点见解；
一---盆骨重建
前面提到，直接通过当前步伐的前后位置来设置Mesh是一个很不错的方法，但是可能会导致一些错误；前文提到的，平滑插值导致的Mesh的运动延迟于脚部是一种，还有一种问题：


直接根据步伐设置盆骨高度的一个可能问题
当角色一只脚在台阶上，一只脚在台阶下时，由于Mesh是左-右-左-右交替插值的，所以会不断的上-下-上-下；但事实上，盆骨的位置往往是由更低的脚来决定的，按照这种路线行进的时候，人不会真的一下站到台阶上，一下又踩到地上；而是会以左脚位置为基础来决定盆骨的高度，也就是始终保持右脚在上，左脚在下，而右脚发力时，左脚会随着右脚有一个抬起，但并不会抬到右脚伸直的程度；

简单解决这个问题可以通过插值来实现，但是插值的平滑程度越高，前面提高的问题也会随即提高；而解决问题的关键在于明确一个点，那就是盆骨的位置高低由较低的脚来决定；

这样，理所应当的能想到：我们可以通过脚的实际高度来反向求解盆骨的高度；
这里我用了和Shadow佬一样的思路，也就是直接设置Mesh来实现对盆骨的位置设置；那么，整理一下我们已经拥有的条件：
首先是当前帧的双脚FootPath信息，这两个FootPath信息是根据双脚ik的水平位置进行预测和计算最终得到的，与Mesh的高度无关；

其次是动画原本的Pose信息，我们需要的实际上是Pose内部的相对位置，比如盆骨相对于较低的ik骨的高度，这些也与Mesh的高度无关；

这样，看起来我们能直接计算出Mesh的标准位置了；我们只需要得到双脚中较低的那个脚的位置，以及Pose中ik到root的偏移量，这样不就可以直接求出来标准的Mesh位置了吗？

这样实现出来，会发现整个人运动起来比较抖，跑起来会产生严重错误，比如过度下压；


错误状态的跑姿
那么问题出在哪里呢？

第二个条件肯定是没问题的，虽然我们得到的Pose来自于上一帧，但是前后两帧的差异可以忽略；

那么第一个条件呢？正是这里出现了问题！


前文提到的一处区别
我在前面这样写到：FootPath并不是最终的脚的位置，而是一个增量；直截了当的说，就是FootPath是要比实际的脚的位置更低的；因此，直接使用会导致过度的下压；那么解决的关键就是，要怎么才能得到实际的脚的位置呢？

按照我们前面所说的计算方式，对于走路来说，最终脚腕的高度 = ik_foot.z + FootPath.z - (Mesh.z+8(脚高))，也就是说最终脚腕的高度是依赖于Mesh的，而我们现在又希望用最终的脚腕高度来计算Mesh，这不是矛盾了吗？

确实（。。。）；

不过好在，根据脚部重建盆骨(应该说重建Mesh)计算的结果比较稳定，这使得直接使用前一帧的Mesh高度来计算也看不出来什么问题；

那么现在还有一个问题，我们前面还提到，直接用FootPath.z - (Mesh.z+8(脚高)) 来计算增幅，对于一些本身动画的脚就比较高的动画来说，会产生一些错误，所以前面对跑步状态有额外的处理；那在这里统一用FootPath.z - (Mesh.z+8(脚高)) 来计算不会出错吗？

答案是：会，但问题不大；这里当然可以用跟最终输出一样的算法来计算，不过就是麻烦点，只是经过测试发现直接使用简单的算法来计算增幅就能实现比较好的Mesh高度了，所以这里投机取巧了一下；

总的来说，就是将实际的较低脚作为基础，根据该脚位置和 动画本身的较低脚相对于root的偏移量，反向求得Mesh的更合理高度；对于这个结果，可以用弹簧插值实现更加稳定的效果；

曲线图是盆骨重建优化的效果；
本文封面图中的曲线图正是这一计算的Debug，绿色是标准的动画中的盆骨到较低脚的距离，黄色是优化前的盆骨到较低脚的距离，红色插值优化后的距离；再之后完全使用了盆骨重建来代替之前的做法，这个Debug也用不了了（可怜我花一大把时间做这个Debug。。。）

在最后说一个小问题，就是这个重建计算中，用的是动画较低脚的信息和实际较低脚的信息用作计算，这两个脚实际上不一定是同一个脚；大多数情况下，动画本身的较低脚是发力脚，但实际输出的较低脚可不一定是发力脚；不过测试下来并没有出现很多问题，唯一的问题是下楼的时候，下楼时的实际较低脚是放松的，而较高脚是发力的；但是用这个计算方式会根据较低脚来确定盆骨的高度，导致较低脚，也就是抬起的那只脚反而有点过度的拉伸；其实上楼也是这个问题，就是位于较低位置的脚拉伸；但上楼的表现倒是没什么异常，可能是因为上楼时候的较低脚拉伸了也问题不大；这个解决方法很简单，当上下楼的时候稍微降一点点盆骨高度就行，这里我给下楼降了8cm，上楼也顺手降了5cm，效果就会好一些；

二---坡面匹配

脚底贴合坡面

脚底贴合坡面
这个实现起来相对容易，我是直接修改了Lyra的Control Rig连在后面；对于落地脚，按照ALS的计算方式修正脚腕位置并且通过Aim Math计算并设置脚腕的旋转，然后重新解算IK；当然像ALS那样直接正交分解一步到位，然后和前面的部分合在一起也是OK的，我这里是图方便省事才又连了个Control Rig在后面；

不过吐槽一下，真的丑；也许人类走这种斜面本身就很怪异；

三---预测IK与传统IK结合
老实说，除了循环动画，预测IK都很容易出岔子；所以我在这选择将非循环运动状态都使用传统IK来实现，而循环动画的部分使用预测IK，通过Modify Curve来进行切换；

传统IK在Idle状态还是会效果更好一点；并且传统IK也有很多实现方式了，相对来说也更稳定；


传统IK

传统IK
四---上下楼
做预测IK的这几天，我感觉自己起码上下楼了五百次。。。

不过仍然没有发现什么好的方法，除非直接使用上下楼动画；如果硬要直接用走跑动画上下楼的话，走路尚且能看，跑步就很难受了；不过还是分享一下目前发现的相对合理的方法（不过极有可能是废话）：

一---降低速度，缩短步距

缩短步距后

缩短步距前
主要就是缩短步距，不要大跨步上下楼，直接降低移速并且配合Stride Wrap，或者手动混合一下动画缩短步距；使每一步的距离和楼梯的宽度差不多；

二---上楼和下楼的盆骨高度做一点调整

下楼盆骨相对较低
前面提到，上下楼的时候盆骨会稍微降一点，其中下楼的盆骨要相对低一些，上楼高一点

三---针对性优化FootPath
这一点也是前面提到的，FootPath上也可以做一些文章；拿我自己的做法来说，我给上楼时的FootPath的后半段额外的增加了高度，这样可以使脚抬得高一点，同时给跑步状态下的整体提升了高度；（不过跑上楼还是很难受）


单独优化FootPath
四---改用专门的上下楼动画
五---别死磕，累了就休息吧
累了就休息吧；

仍然需要解决的问题：
一---多个动画混合时预测不准
尽可能把各项数据对齐，特别是一开始提到的，对于什么动作定义为踩下一定要明确清楚；

二---检测错误/未检测到/进入传统IK导致数据没有同步
对于这一块我是人肉Debug和打补丁的哎

三---一个预想/给自己画饼：水平方向的主动校正
既然预测到了下一次的落点，那么有没有可能在落地基础上进行偏移，使结果更进一步？比如每次上楼梯都踩在中心位置？比如当只有脚趾/脚腕才在台阶上的时候会主动校正？

四---落地脚不能踩实
虽然给了一个落地脚下沉的处理，但是对于跑步之类的动作，落地的时间特别短，根本来不及沉下去；

五---穿墙脚/穿墙腿问题
虽然在实现中有处理，但是往往要么直接把穿墙脚偏移出来，要么插值出来，效果欠佳；